# BaseExportOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseExportOptions Class
Members See Also
---
The base class for options used to export DWG, DXF and DGN format files.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class BaseExportOptions : IDisposable
```

Visual Basic
---
```text
Public Class BaseExportOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class BaseExportOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BaseExportOptions Autodesk.Revit.DB..::..ACADExportOptions Autodesk.Revit.DB..::..DGNExportOptions
# See Also
BaseExportOptions Members
Autodesk.Revit.DB Namespace